org/CoqArt.org
Coq Art

* Everyday Logic(常用逻辑)

| 页码 | 位置                   | 原文                       | 翻译                                                 | 建议                                               |
|------+------------------------+----------------------------+------------------------------------------------------+----------------------------------------------------|
|   89 |                        | well-typed                 | 合法类型                                             | 良型                                               |
|   91 | Exercise 5.1           | closed statements          | 封闭声明                                             | 闭式                                               |
|   92 |                        | Head and Final Types       | 首类型和终极类型                                     | 头类型和最终类型                                   |
|  104 | Excercise 5.5 上面一段 | namely                     | 即说                                                 | 不翻译                                             |
|  106 | 标题                   | Equality                   | 等式                                                 | 相等性                                             |
|  113 | 标题                   | Leibniz Equality           | Leibniz等式                                          | Leibniz(莱布尼茨)等价                              |
|  114 | 标题5.5.4上面一段      | cannot be used for...      | 并运用于                                             | 并不能用于                                         |
|  116 | 倒数第二段             | where functions receive... | 这里的函数把另一个描述如何使用计算结果的函数作为变量 | 即函数把另一个描述如何使用其计算结果的函数作为参数 |

* 实例分析

| 页码 | 位置           | 原文                                    | 翻译                   | 建议                         |
|------+----------------+-----------------------------------------+------------------------+------------------------------|
|  267 | 第二段         | whole development                       | 完整开发的过程         | 完整的程序                   |
|  268 | 11.1.2标题     | A Naive Approach to Deciding Occurrence | 一个天真的存在判定方法 | 一个直接的判定存在的方法     |
|  268 | 脚注           | hint database                           | 提示数据库             | 不翻译                       |
|  269 | 11.1.3上面一段 | occurrence test                         | 存在判断               | 判定存在 或 存在性判断       |
|  270 | 练习11.1       | user contribution                       | 用户贡献               | 第三方库                     |
|  272 | 最后一段       | technical lemmas                        | 技术性引理库           | 引理库(技术性引理库太生硬了) |
|  280 | 最后一段       | partial functions                       | 部分函数               | 偏函数(保留英文原文)         |
|  280 | 最后一段       | with finite domain                      | 本段两处翻译不一致     | 有限定义域                   |
|  281 |                | specify                                 | 说明                   | 规范                         |
|  281 |                | specialized version for arrays or lists | 数组和列表的特殊形式   | 以数组或列表实例化的版本     |

* 通用递归

| 页码 | 位置            | 原文                                                 | 翻译                                      | 建议                             |
|------+-----------------+------------------------------------------------------+-------------------------------------------+----------------------------------|
|  359 | 本章标题        | General Recursion                                    | 通用递归                                  | 一般递归                         |
|  360 | 第三段          | generates a goal                                     | 推广了一个目标                            | 产生了一个新的目标               |
|  361 | 第三段          | divisor is non-zero                                  | 被除数是0                                 | 除数不为0                        |
|  361 | 第三段          | to avoid building proof term that is later forgotten | 以避免花费时间2构造一个以后会忘却的证明项 | 以避免构造一个我们不关心的证明项 |
|  361 | 脚注2           | with a clock speed of 400MHz                         | 时钟为400MHz                              | 时钟频率为400MHz                 |
|  362 | Excercise 15.2  | well-sepcified                                       | 完整定义                                  | 良规范                           |
|  363 | 第三段          | eliminating                                          | 删除                                      | 消去                             |
|  365 | 15.2.4第一段    | can be hidden                                        | 对程序员不可见                            | 可以对程序员不可见               |
|  369 | Excercise 15.10 | for other integers                                   | 其他输入                                  | 其他整数                         |
|      |                 |                                                      |                                           |                                  |








