org/CoqArt.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Coq Art</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-12-22 20:00:05 CST"/>
<meta name="author" content="S.M.Yang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="base.css">


</head>
<body>
<div id="content">

<h1 class="title">Coq Art</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Everyday Logic(常用逻辑) </a></li>
<li><a href="#sec-2">2 实例分析 </a></li>
<li><a href="#sec-3">3 通用递归 </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Everyday Logic(常用逻辑) </h2>
<div class="outline-text-2" id="text-1">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="right" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">页码</th><th scope="col" class="left">位置</th><th scope="col" class="left">原文</th><th scope="col" class="left">翻译</th><th scope="col" class="left">建议</th></tr>
</thead>
<tbody>
<tr><td class="right">89</td><td class="left"></td><td class="left">well-typed</td><td class="left">合法类型</td><td class="left">良型</td></tr>
<tr><td class="right">91</td><td class="left">Exercise 5.1</td><td class="left">closed statements</td><td class="left">封闭声明</td><td class="left">闭式</td></tr>
<tr><td class="right">92</td><td class="left"></td><td class="left">Head and Final Types</td><td class="left">首类型和终极类型</td><td class="left">头类型和最终类型</td></tr>
<tr><td class="right">104</td><td class="left">Excercise 5.5 上面一段</td><td class="left">namely</td><td class="left">即说</td><td class="left">不翻译</td></tr>
<tr><td class="right">106</td><td class="left">标题</td><td class="left">Equality</td><td class="left">等式</td><td class="left">相等性</td></tr>
<tr><td class="right">113</td><td class="left">标题</td><td class="left">Leibniz Equality</td><td class="left">Leibniz等式</td><td class="left">Leibniz(莱布尼茨)等价</td></tr>
<tr><td class="right">114</td><td class="left">标题5.5.4上面一段</td><td class="left">cannot be used for&hellip;</td><td class="left">并运用于</td><td class="left">并不能用于</td></tr>
<tr><td class="right">116</td><td class="left">倒数第二段</td><td class="left">where functions receive&hellip;</td><td class="left">这里的函数把另一个描述如何使用计算结果的函数作为变量</td><td class="left">即函数把另一个描述如何使用其计算结果的函数作为参数</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 实例分析 </h2>
<div class="outline-text-2" id="text-2">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="right" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">页码</th><th scope="col" class="left">位置</th><th scope="col" class="left">原文</th><th scope="col" class="left">翻译</th><th scope="col" class="left">建议</th></tr>
</thead>
<tbody>
<tr><td class="right">267</td><td class="left">第二段</td><td class="left">whole development</td><td class="left">完整开发的过程</td><td class="left">完整的程序</td></tr>
<tr><td class="right">268</td><td class="left">11.1.2标题</td><td class="left">A Naive Approach to Deciding Occurrence</td><td class="left">一个天真的存在判定方法</td><td class="left">一个直接的判定存在的方法</td></tr>
<tr><td class="right">268</td><td class="left">脚注</td><td class="left">hint database</td><td class="left">提示数据库</td><td class="left">不翻译</td></tr>
<tr><td class="right">269</td><td class="left">11.1.3上面一段</td><td class="left">occurrence test</td><td class="left">存在判断</td><td class="left">判定存在 或 存在性判断</td></tr>
<tr><td class="right">270</td><td class="left">练习11.1</td><td class="left">user contribution</td><td class="left">用户贡献</td><td class="left">第三方库</td></tr>
<tr><td class="right">272</td><td class="left">最后一段</td><td class="left">technical lemmas</td><td class="left">技术性引理库</td><td class="left">引理库(技术性引理库太生硬了)</td></tr>
<tr><td class="right">280</td><td class="left">最后一段</td><td class="left">partial functions</td><td class="left">部分函数</td><td class="left">偏函数(保留英文原文)</td></tr>
<tr><td class="right">280</td><td class="left">最后一段</td><td class="left">with finite domain</td><td class="left">本段两处翻译不一致</td><td class="left">有限定义域</td></tr>
<tr><td class="right">281</td><td class="left"></td><td class="left">specify</td><td class="left">说明</td><td class="left">规范</td></tr>
<tr><td class="right">281</td><td class="left"></td><td class="left">specialized version for arrays or lists</td><td class="left">数组和列表的特殊形式</td><td class="left">以数组或列表实例化的版本</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 通用递归 </h2>
<div class="outline-text-2" id="text-3">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="right" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">页码</th><th scope="col" class="left">位置</th><th scope="col" class="left">原文</th><th scope="col" class="left">翻译</th><th scope="col" class="left">建议</th></tr>
</thead>
<tbody>
<tr><td class="right">359</td><td class="left">本章标题</td><td class="left">General Recursion</td><td class="left">通用递归</td><td class="left">一般递归</td></tr>
<tr><td class="right">360</td><td class="left">第三段</td><td class="left">generates a goal</td><td class="left">推广了一个目标</td><td class="left">产生了一个新的目标</td></tr>
<tr><td class="right">361</td><td class="left">第三段</td><td class="left">divisor is non-zero</td><td class="left">被除数是0</td><td class="left">除数不为0</td></tr>
<tr><td class="right">361</td><td class="left">第三段</td><td class="left">to avoid building proof term that is later forgotten</td><td class="left">以避免花费时间2构造一个以后会忘却的证明项</td><td class="left">以避免构造一个我们不关心的证明项</td></tr>
<tr><td class="right">361</td><td class="left">脚注2</td><td class="left">with a clock speed of 400MHz</td><td class="left">时钟为400MHz</td><td class="left">时钟频率为400MHz</td></tr>
<tr><td class="right">362</td><td class="left">Excercise 15.2</td><td class="left">well-sepcified</td><td class="left">完整定义</td><td class="left">良规范</td></tr>
<tr><td class="right">363</td><td class="left">第三段</td><td class="left">eliminating</td><td class="left">删除</td><td class="left">消去</td></tr>
<tr><td class="right">365</td><td class="left">15.2.4第一段</td><td class="left">can be hidden</td><td class="left">对程序员不可见</td><td class="left">可以对程序员不可见</td></tr>
<tr><td class="right">369</td><td class="left">Excercise 15.10</td><td class="left">for other integers</td><td class="left">其他输入</td><td class="left">其他整数</td></tr>
</tbody>
</table>









</div>
</div>
<div id="postamble">
<p class="author"> Author: S.M.Yang
</p>
<p class="date"> Date: 2010-12-22 20:00:05 CST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
